Series from dictionaries
keys >>>> index
values >>>> data

In [1]:
import pandas as pd

In [2]:
d = {'a':100, 'b':200, 'c':300}

In [3]:
s1 = pd.Series(d)

In [4]:
s1

a    100
b    200
c    300
dtype: int64

In [5]:
d1 = {'USA':1, 'Gernmany':2, 'USSR':3, 'Japan':4}

In [6]:
s1 = pd.Series(d1)

In [7]:
s1

USA         1
Gernmany    2
USSR        3
Japan       4
dtype: int64

In [8]:
d2 = {'USA':1, 'Gernmany':2, 'Japan':4, 'Italy':5}

In [9]:
s2 = pd.Series(d2)

In [10]:
s2

USA         1
Gernmany    2
Japan       4
Italy       5
dtype: int64

In [11]:
d1['Italy'] = 5

In [12]:
d1

{'USA': 1, 'Gernmany': 2, 'USSR': 3, 'Japan': 4, 'Italy': 5}

In [13]:
s1+s2 #Index is independent of values(data)
#If index is not common then '+' operator on series will get indexs

Gernmany    4.0
Italy       NaN
Japan       8.0
USA         2.0
USSR        NaN
dtype: float64

Dataframe from a Dictionary

keys >>>> columns
values >>>> data rows
index >>>> default

In [14]:
d = {'col1':[100,200,300], 'col2':[400,500,600]}

In [15]:
df = pd.DataFrame(d)

In [16]:
df

   col1  col2
0   100   400
1   200   500
2   300   600

In [17]:
#dataframe from a dictionary

In [18]:
d1 = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
      'Person':['Sam','Charli','Amy','Vanessa','Carl','Sarah'],
      'Sales':[200,120,340,124,234,350]}

In [19]:
df1 = pd.DataFrame(d1)

In [20]:
df1

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG   Charli    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    234
5      FB    Sarah    350

Oprations on Pandas Dataframe

In [21]:
df1.groupby('Company').mean()

         Sales
Company
FB         292
GOOG       160
MSFT       232

In [22]:
df1.groupby('Company').sum()

         Sales
Company
FB         584
GOOG       320
MSFT       464

In [23]:
df1.groupby('Company').count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [24]:
#NOTE: causiously use max() and min() on dataframes,
#as the can only returns the max or min of values not done by whom
df1.groupby('Company').max()

          Person  Sales
Company
FB         Sarah    350
GOOG         Sam    200
MSFT     Vanessa    340

In [25]:
#Dataframe for hadling null(NaN) values

In [26]:
import numpy as np

In [27]:
d = {'col1':[1,2],
    'col2':[3],
    'col3':[4,5,6]}

In [28]:
df = pd.DataFrame(d)
df

ValueError: arrays must all be same length

In [29]:
d = {'col1':[1,2,np.nan],
    'col2':[3,np.nan,np.nan],
    'col3':[4,5,6]}

In [30]:
df = pd.DataFrame(d)

In [31]:
df

   col1  col2  col3
0   1.0   3.0     4
1   2.0   NaN     5
2   NaN   NaN     6

In [32]:
#Handling NaN values -> using df.dropna()
#Droping the columns or rows having NaN values

In [33]:
df.dropna()

   col1  col2  col3
0   1.0   3.0     4

In [34]:
df.dropna(thresh=2)

   col1  col2  col3
0   1.0   3.0     4
1   2.0   NaN     5

In [35]:
df.dropna(axis=1)

   col3
0     4
1     5
2     6

In [36]:
df.dropna(axis=1, thresh=2)

   col1  col3
0   1.0     4
1   2.0     5
2   NaN     6

In [37]:
#Handling NaN values -> using df.fillna()
#Filling the columns or rows having NaN values

In [38]:
df.fillna('FILL VALUE')

         col1        col2  col3
0           1           3     4
1           2  FILL VALUE     5
2  FILL VALUE  FILL VALUE     6

In [39]:
df['col1'].fillna('THIS VALUE')

0             1
1             2
2    THIS VALUE
Name: col1, dtype: object

In [40]:
df['col1'].mean()

1.5

In [41]:
df['col1'].fillna(df['col1'].mean())

0    1.0
1    2.0
2    1.5
Name: col1, dtype: float64

In [42]:
df

   col1  col2  col3
0   1.0   3.0     4
1   2.0   NaN     5
2   NaN   NaN     6

In [43]:
df['col1'].fillna(df['col1'].mean(), inplace=True)

In [44]:
df

   col1  col2  col3
0   1.0   3.0     4
1   2.0   NaN     5
2   1.5   NaN     6

In [45]:
#Dataframe functions

In [46]:
d = {'col1':[1,2,3,4],
    'col2':[444,555,666,444],
    'col3':['abc','def','ghi','xyz']}

In [47]:
df = pd.DataFrame(d)

In [48]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [49]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   col1    4 non-null      int64
 1   col2    4 non-null      int64
 2   col3    4 non-null      object
dtypes: int64(2), object(1)
memory usage: 224.0+ bytes

In [50]:
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [51]:
df['col2'].nunique()

3

In [52]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [53]:
#function to square a number

In [54]:
def num_square(n):
    return n*n

In [55]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [56]:
#Apply a function to dataframes

In [57]:
df['col1_sq'] = df['col1'].apply(num_square)

In [58]:
df

   col1  col2 col3  col1_sq
0     1   444  abc        1
1     2   555  def        4
2     3   666  ghi        9
3     4   444  xyz       16

In [59]:
#lambda expression to twice each items in col2

In [60]:
df['col2_twice'] = df['col2'].apply(lambda n: n*2)

In [61]:
df

   col1  col2 col3  col1_sq  col2_twice
0     1   444  abc        1         888
1     2   555  def        4        1110
2     3   666  ghi        9        1332
3     4   444  xyz       16         888